Revit 2027 API
CylindricalHelix.Radius Property
The radius of the cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
public:
property double Radius {
	double get ();
}
member Radius : float with get
Property Value
Double
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace